app/Http/Livewire/EditEmail.php

    public function mount($id)
    {
        $email_journeys = EmailJourney::where('id', $id)->first();
        $this->name = $email_journeys->name;
        $this->subject = $email_journeys->subject;
        $this->body = $email_journeys->body;
        $this->trigger_date_type = $email_journeys->trigger_date_type;
        $this->treatment_type_id = ($email_journeys->treatment_type_id == null) ? 0 : $email_journeys->treatment_type_id;
        $this->days = $email_journeys->days;
        $this->status = $email_journeys->status;
        $this->edit_id = $id;

        $this->treatments = TreatmentType::orderBy('id', 'DESC')->get();
---
select * from `email_journeys` where `id` = '41' limit 1
select * from `treatment_types` where `treatment_types`.`deleted_at` is null order by `id` desc