app/Http/Livewire/EmailList.php

select `email_journeys`.*, `treatment_types`.`description` as `description` from `email_journeys` left join `treatment_types` on `treatment_type_id` = `treatment_types`.`id`
---
    public function render()
    {
        $this->email_journeys_list = EmailJourney::select('email_journeys.*', 'treatment_types.description as description')
        ->leftJoin('treatment_types', 'treatment_type_id', '=', 'treatment_types.id')->get();

select * from `email_journeys` where `id` = '42' limit 1
select * from `email_communications` where `name` = 'ticket template'
---
    public function updateStatus(Request $request)
    {
        $emailJourney = new EmailJourney;
        $record = EmailJourney::where('id', $request['id'])->first();

        $emailComms = EmailCommunication::where('name', $record['name'])->get();