app/Http/Controllers/PatientController.php

select * from `tickets` where `tickets`.`patient_id` = 1 and `tickets`.`patient_id` is not null
---
    public function overview(Patient $patient,Payment $payment)
    {

      $current_location = session('current_location');
      if($patient->location_id !== $current_location->id) return redirect()->route('patient.index');

        $tickets = $patient->tickets;
        $office_visits =  $tickets->count();
        $avg_order =  $tickets->avg('total');

select * from `email_communications` where `id` = '20' limit 1
---
    public function deleteEmailCommunication(Request $request)
    {
        $record = EmailCommunication::where('id', $request['id'])->first();