app/Http/Controllers/ScheduleController.php

select * from `schedule_blocks` where `location_id` = 1 and `date` >= '2022-10-30' and `date` <= '2022-12-11' and `schedule_blocks`.`deleted_at` is null
---
    public function getAppts(Request $request, Schedule $schedule)
    {
        $current_location = session('current_location')->id;
        $req = $request->all();
        $start = Carbon::parse($req['start'])->format('Y-m-d');
        $end = Carbon::parse($req['end'])->format('Y-m-d');

        $appts['appts'] = $schedule->getAppointmentsWithPatient($start, $end);
        $appts['blocks'] = ScheduleBlock::where('location_id', $current_location)->where('date', '>=', $start)->where('date', '<=', $end)->get();

select * from `schedule_blocks` where `location_id` = 1 and `date` >= '2022-11-01' and `date` <= '2022-11-01' and `schedule_blocks`.`deleted_at` is null
---
    public function getApptBlocks(Request $request)
    {
        $current_location = session('current_location')->id;
        $blocks = ScheduleBlock::where('location_id', $current_location)->where('date', '>=', $request['start'])->where('date', '<=', $request['end'])->get();

select * from `patients` where `patients`.`id` = 8 limit 1
---
    public function sendEmailWithAppointmentTemplate($locationName, $data)
    {
        $patient_id = $data['patient_id'];
        $appointment_date = Carbon::parse($data['date'])->format('Y-m-d');
        $patient = Patient::find($patient_id);

select * from `tickets` where `tickets`.`schedule_id` = 14 and `tickets`.`schedule_id` is not null
---
    public function edit(Schedule $appointment, Patient $patient)
    {
        $current_location = session('current_location');
        if ($appointment->location_id !== $current_location->id) return redirect()->route('schedule.index');

        //show check in patient button;
        $apptdate = Carbon::parse($appointment->date);
        $hidden = false;
        if (now()->format('Y-m-d') == $apptdate->format('Y-m-d') || now()->greaterThan($apptdate)) {
            $hidden = true;
        }
        $res['hidden'] = $hidden;
        // $res['hidden'] = true;
        //parse date
        $appointment->date = $apptdate->format('m/d/Y');
        $current_location = session('current_location')->id;
        if (!session('cl')) {
            session(['cl' => $current_location]);
        } else {

            if (url()->previous() == url("edit/appointment/$appointment->id"))  if (session('cl') != $current_location) {
                session()->forget('cl');
                return  redirect()->route('schedule.index');
            };
        }
        $ticket = $appointment->getTicket->first();

select * from `email_communications` where `patient_id` = 8
---
    public function deleteUnsentEmailCommunications($patient_id, $trigger_date_type, $status)
    {
        $records = EmailCommunication::where('patient_id', $patient_id)->get();