app/Http/Controllers/TicketController.php

    public function sendEmailWithTicketTemplate($locationName, $data, $treatment_type_id)
    {
        $patient_id = $data['patient_id'];
        $appointment_date = Carbon::parse($data['date'])->format('Y-m-d');
        $patient = Patient::find($patient_id);
---
select * from `patients` where `patients`.`id` = 1 limit 1

    public function edit(Request $request, Ticket $ticket, Schedule $appointment, UserLocation $userLocation)
    {
        $current_location = session('current_location')->id;
        if (!session('cl')) {
            session(['cl' => $current_location]);
        } else {
            if (url()->previous() == url("edit/ticket/$ticket->id/$appointment->id"))  if (session('cl') != $current_location) {
                session()->forget('cl');
                return  redirect()->route('ticket.index');
            };
        }
        $res['page_title'] = 'Tickets';
        $res['card_title'] = 'Edit Ticket';
        $res['appointment'] = $appointment;
        $res['products'] = Product::getProductsOfCurrentLocationForTicket();
        $res['services'] = Service::getServicesOfCurrentLocationForTicket();
        $res['ticket_services'] = $ticket->services;
        //Get services array to be checked but exclude Refill
        $res['ticket_services_ids'] = $res['ticket_services']->pluck('service_id')->toArray();
        $current_location = session('current_location');
        $res['ticket_products'] = TicketProduct::with('product')->where('ticket_id', $ticket->id)
            ->join('products', 'products.id', 'ticket_products.product_id')
            ->select('ticket_products.*', 'products.location_id')
            ->where('products.location_id', $current_location->id)
            ->get();
        $res['ticket'] = $ticket;
        $res['ticket']->treatment_end_date = $ticket->treatment_end_date ?? $ticket->date;

        $res['treatment_types'] = TreatmentType::where('location_id', $current_location->id)->get();
---
select `ticket_products`.*, `products`.`location_id` from `ticket_products` inner join `products` on `products`.`id` = `ticket_products`.`product_id` where `ticket_id` = 19 and `products`.`location_id` = 1
select * from `treatment_types` where `location_id` = 1 and `treatment_types`.`deleted_at` is null

        $res['users'] = $userLocation->currentLocationUsers();
        $res['sales_counselor'] = $ticket->sales_counselor;

        $res['longest_duration_product'] = TicketProduct::with('product')->where('ticket_id', $ticket->id)->orderBy('custom_amount', 'desc')->first();
---
select * from `ticket_products` where `ticket_id` = 19 order by `custom_amount` desc limit 1

        {
            if ($ticket->month_plan !== 'full') {
                // on update ticket delete receivables and payments
                Receivable::where('ticket_id', $ticket->id)->delete();
---
delete from `receivables` where `ticket_id` = 13

            }

            $ticketData = collect($ticket);
            $ticketProducts = TicketProduct::with(['product', 'product.productType'])->where('ticket_id', $ticket->id)->get();
---
select * from `ticket_products` where `ticket_id` = 13

    public function deleteUnsentEmailCommunications($patient_id, $trigger_date_type, $status)
    {
        $records = EmailCommunication::where('patient_id', $patient_id)->get();
---
select * from `email_communications` where `patient_id` = 1