app/Models/EmailJourney.php

    public function updateEmailJourney($id, $request)
    {
        try{
            self::where('id', $id)->update($request);
---
update `email_journeys` set `name` = 'ticket template', `subject` = 'ticket user', `body` = 'This is ticket template', `trigger_date_type` = 1, `days` = 7, `treatment_type_id` = 3, `status` = 1, `email_journeys`.`updated_at` = '2022-10-12 07:38:26' where `id` = '42'

    static function getTemplate($date_type, $treatment_type)
    {
        $template = null;

        if($date_type == 2){
           $template = self::where('trigger_date_type', $date_type)->where('status', 1)->first();
        }
        else{
            $template = self::where('trigger_date_type', $date_type)->where('treatment_type_id', $treatment_type)->where('status', 1)->first();
---
select * from `email_journeys` where `trigger_date_type` = 2 and `status` = 1 limit 1
select * from `email_journeys` where `trigger_date_type` = 1 and `treatment_type_id` = '4' and `status` = 1 limit 1