app/Models/EmailCommunication.php

insert into `email_communications` (`patient_id`, `name`, `send_date`, `updated_at`, `created_at`) values (502, 'appointment template', '2022-10-11 15:01:07', '2022-10-11 15:01:07', '2022-10-11 15:01:07')
---
    public function storeEmailCommunication($request)
    {
        try
        {
            $saved = self::create($request);

select * from `email_communications` where `patient_id` = 1
---
    static function getAll($id)
    {
        $arr = self::where('patient_id', $id)->get();

delete from `email_communications` where `id` = 27
---
    public function deleteEmailCommunication(self $self)
    {
        try{
            EmailCommunication::where('id', $self->id)->delete();