app/Models/Location.php

  static function getAll()
  {
    return self::orderBy('location_name')->get();
---
select * from `locations` order by `location_name` asc