app/Models/Patient.php

select * from `patients` where `location_id` = 1
---
    public function getAll(){
        return self::where('location_id',session('current_location')->id)->get();

select count(*) as aggregate from `patients`
select count(*) as aggregate from `patients` where `patients`.`location_id` = 1 and (`first_name` like '%n%' or `last_name` like '%n%' or `home_phone` like '%n%' or `cell_phone` like '%n%' or `email` like '%n%' or `date_of_birth` like '%n%' or `address` like '%n%')
select `patients`.* from `patients` where `patients`.`location_id` = 1 and (`first_name` like '%n%' or `last_name` like '%n%' or `home_phone` like '%n%' or `cell_phone` like '%n%' or `email` like '%n%' or `date_of_birth` like '%n%' or `address` like '%n%') order by `first_name` asc limit 10 offset 0
---
    public static function dataTable($request)
    {
      ## Read value
      $current_location_id = session('current_location')->id;
      $draw = $request->get('draw');
      $start = $request->get("start");
      $rowperpage = $request->get("length"); // Rows display per page

      $columnIndex_arr = $request->get('order');
      $columnName_arr = $request->get('columns');
      $order_arr = $request->get('order');
      $search_arr = $request->get('search');

      $columnIndex = $columnIndex_arr[0]['column']; // Column index
      $columnName = $columnName_arr[$columnIndex]['data']; // Column name
      $columnSortOrder = $order_arr[0]['dir']; // asc or desc
      $searchValue = $search_arr['value']; // Search value

      // Total records
      $totalRecords = Patient::select('count(*) as allcount')->count();
      $totalRecordswithFilter = Patient::select('count(*) as allcount')
      ->where('patients.location_id',$current_location_id  )
      ->where(function($q) use($searchValue){
            $q->where('first_name', 'like', '%' .$searchValue . '%')
            ->OrWhere('last_name', 'like', '%' .$searchValue . '%')
            ->OrWhere('home_phone', 'like', '%' .$searchValue . '%')
            ->OrWhere('cell_phone', 'like', '%' .$searchValue . '%')
            ->OrWhere('email', 'like', '%' .$searchValue . '%')
            ->OrWhere('date_of_birth', 'like', '%' .$searchValue . '%')
            ->OrWhere('address', 'like', '%' .$searchValue . '%');
      })
      ->count();

      // Fetch records
      $records = Patient::orderBy($columnName,$columnSortOrder)
      ->where('patients.location_id',$current_location_id  )
      ->where(function($q) use($searchValue){
            $q->Where('first_name', 'like', '%' .$searchValue . '%')
            ->OrWhere('last_name', 'like', '%' .$searchValue . '%')
            ->OrWhere('home_phone', 'like', '%' .$searchValue . '%')
            ->OrWhere('cell_phone', 'like', '%' .$searchValue . '%')
            ->OrWhere('email', 'like', '%' .$searchValue . '%')
            ->OrWhere('date_of_birth', 'like', '%' .$searchValue . '%')
            ->OrWhere('address', 'like', '%' .$searchValue . '%');
      })
      ->select('patients.*')
      ->skip($start)
      ->take($rowperpage)
      ->get();