app/Models/Product.php

    static function getProductsOfCurrentLocationForTicket()
    {
        $current_location = session('current_location');
        $products = self::where('location_id', $current_location->id)->where('disable', 0)->get();
---
select * from `products` where `location_id` = 1 and `disable` = 0 and `products`.`deleted_at` is null