app/Models/Schedule.php

select `schedules`.*, `patients`.`first_name`, `patients`.`last_name`, `patients`.`home_phone`, `patients`.`cell_phone` from `schedules` inner join `patients` on `patients`.`id` = `schedules`.`patient_id` where `schedules`.`location_id` = 1 and date(`schedules`.`date`) = '2022-10-12'
---
    public function getAppointmentsWithPatientOfToday()
    {
        ///get current location
        $current_location = session('current_location');
        /// if not location selected return ERROR
        if (!$current_location) return collect();
        /// return appointments and patient
        return self::join('patients', 'patients.id', 'schedules.patient_id')
            ->where('schedules.location_id', $current_location->id)
            ->whereDate('schedules.date', now()->format('Y-m-d'))
            ->select('schedules.*', 'patients.first_name', 'patients.last_name', 'patients.home_phone', 'patients.cell_phone')
            ->get();

select * from `patients` where `patients`.`id` = '502' limit 1
---
                return ['status' => 1, 'msg' => "Appointment created successfully.", 'data' => $self];
            }
            if (strtolower($params['currentOrnew']) == 'current') {
                $patient = Patient::find($params['current_patient']);

select count(*) as aggregate from `schedules` where `patient_id` = 502
---
                $self->note = $params['appointment_note'];
                $self->appointment_type = $params['appointment_type'];
                $self->schedule_type_id = 1;
                $count =  self::where('patient_id', $self->patient_id)->count();

select * from `patients` where `location_id` = 1 and (`first_name` like '%aa%' or `last_name` like '%aa%')
---
    static function ajaxSearchPatient($req)
    {

        $data = Patient::where('location_id', session('current_location')->id)
            ->where(function ($q) use ($req) {
                $q->where('first_name', 'like', '%' . $req->searchTerm . '%')
                    ->orWhere('last_name', 'like', '%' . $req->searchTerm . '%');
            })->get();