app/Models/ScheduleType.php

select * from `schedule_types` where `schedule_types`.`id` = 8 limit 1
---
    static function getAlertType(int $id)
    {
        $self = self::find($id);