app/Models/Service.php

select * from `services` where `location_id` = 1 and `disable` = 0
---
    static function getServicesOfCurrentLocationForTicket()
    {
        $current_location = session('current_location');
        $services =  self::where('location_id', $current_location->id)->where('disable', 0)->get();