app/Models/Ticket.php

    public function _update(self $self, $params)
    {
        try {
            $params['date'] = Carbon::parse($params['date'])->format('Y-m-d');
            $params['modified_by'] = auth()->user()->id;

            $self->update($params);

            TicketService::where('ticket_id', $self->id)->delete();
            TicketProduct::where('ticket_id', $self->id)->delete();
---
delete from `ticket_services` where `ticket_id` = 13
delete from `ticket_products` where `ticket_id` = 13

    public static function dataTablePatientTicket($request, int $patient)
    {
        ## Read value
        $draw = $request->get('draw');
        $start = $request->get("start");
        $rowperpage = $request->get("length"); // Rows display per page
        $columnIndex_arr = $request->get('order');
        $columnName_arr = $request->get('columns');
        $order_arr = $request->get('order');
        $search_arr = $request->get('search');
        $columnIndex = $columnIndex_arr[0]['column']; // Column index
        $columnName = $columnName_arr[$columnIndex]['data']; // Column name
        $columnSortOrder = $order_arr[0]['dir']; // asc or desc
        $searchValue = $search_arr['value']; // Search value
        //get current location
        $current_location = session('current_location');
        $current_location_id = $current_location->id;
        //Refill ID
        //$refill_id =18;
        // Total records
        $totalRecords = Ticket::select('count(*) as allcount')->where('tickets.patient_id', $patient)->count();
---
select count(*) as aggregate from `tickets` where `tickets`.`patient_id` = 1

        foreach ($records as $record) {
            $record->purchased = '';
            $productsIds = $record->products->pluck('product_id')->toArray();
            $p = Product::whereIn('id', $productsIds)->get()->map(function ($p) use ($record) {
                $product = $record->products->where('product_id', $p->id)->first();
                $amount = $product ? $product->custom_amount : 0;
                $price = $product ? $product->custom_price : 0;
                $text =  "$p->name - " . number_format($amount, 0) . " dose(s)/month(s) for $" . number_format($price, 2);
                $record->purchased .= '<li>' . $text . "</li>";
            });
---
select * from `products` where 0 = 1 and `products`.`deleted_at` is null

    public static function dataTable($request)
    {

        ## Read value
        $draw = $request->get('draw');
        $start = $request->get("start");
        $rowperpage = $request->get("length"); // Rows display per page
        $columnIndex_arr = $request->get('order');
        $columnName_arr = $request->get('columns');
        $order_arr = $request->get('order');
        $search_arr = $request->get('search');
        $columnIndex = $columnIndex_arr[0]['column']; // Column index
        $columnName = lcfirst($columnName_arr[$columnIndex]['data']); // Column name
        $columnSortOrder = $order_arr[0]['dir']; // asc or desc
        $searchValue = $search_arr['value']; // Search value
        //get current location
        $current_location = session('current_location');
        $current_location_id = $current_location->id;
        // Total records
        $totalRecords = Ticket::select('count(id) as allcount')->where('tickets.location_id', $current_location_id)->count();
---
select count(*) as aggregate from `tickets` where `tickets`.`location_id` = 1