app/Models/UserLocation.php

  public function currentLocationUsers()
  {
    //current location
    $current_location = session('current_location');
    $locations  = self::where('location_id', $current_location->id)->where('user_id', '!=', '1')->select('user_id')->get()->pluck('user_id')->toArray();
---
select `user_id` from `user_location` where `location_id` = 1 and `user_id` != '1'