app/Models/ZingleIntegration.php

select exists(select * from `zingle_integrations` where `location_id` = 1 and `enabled` = 1) as `exists`
---
    public function isEnabled(int $locationId)
    {
        return $this->where('location_id', $locationId)
            ->where('enabled', self::STATUS_ENABLED)
            ->exists();